-- MySQL dump 10.13  Distrib 8.0.30, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: test1
-- ------------------------------------------------------
-- Server version	8.0.30

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `s21_s`
--

DROP TABLE IF EXISTS `s21_s`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `s21_s` (
  `id` bigint NOT NULL AUTO_INCREMENT,
  `학년도` text,
  `학기` text,
  `소속` text,
  `학과` text,
  `과목번호` text,
  `분반` text,
  `과목명` text,
  `강의계획서` text,
  `학점` bigint DEFAULT NULL,
  `수업시간_강의실` text,
  `교수진` text,
  `수강생수` text,
  `영어강의` text,
  `중국어강의` text,
  `공학인증` text,
  `국제학생` text,
  `Honors과목` text,
  `홀짝구분` text,
  `승인과목` text,
  `시험일자` text,
  `수강대상` text,
  `권장학년` text,
  `수강신청_참조사항` text,
  `과목_설명` text,
  `비고` text,
  `subject_id` text,
  `department` text,
  `요일1` text,
  `요일2` text,
  `시작시간` text,
  `종료시간` text,
  `강의실` text,
  `대면여부` text,
  `강의언어` text,
  `시간` text,
  `시간1` text,
  `시간2` text,
  PRIMARY KEY (`id`),
  KEY `ix_s21_s_id` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=303 DEFAULT CHARSET=utf8mb3;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `s21_s`
--

LOCK TABLES `s21_s` WRITE;
/*!40000 ALTER TABLE `s21_s` DISABLE KEYS */;
INSERT INTO `s21_s` VALUES (240,'2021 학년도','하계학기','학부','철학전공','PHI2001','01','철학개론',NULL,3,'월,화,수,목,금 09:00~11:45','김영건','0000000018','','','','','','','','','전학년','2-4학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(241,'2021 학년도','하계학기','학부','철학전공','PHI2005','01','논리학개론',NULL,3,'월,화,수,목,금 13:00~15:45','오은영','0000000026','','','','','','','','','전학년','2-4학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(242,'2021 학년도','하계학기','학부','수학전공','MAT2010','01','집합론',NULL,3,'월,화,수,목,금 13:00~15:45','하구용','0000000022','','','','','','','','','전학년','2학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(243,'2021 학년도','하계학기','학부','수학전공','MAT2110','01','선형대수학',NULL,3,'월,화,수,목,금 09:00~11:45','조성희','0000000060','','','','','','','','','전학년','2학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(244,'2021 학년도','하계학기','학부','수학전공','MAT2120','01','정수론',NULL,3,'월,화,수,목,금 13:00~15:45','김지현','0000000020','','','','','','','','','전학년','2학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(245,'2021 학년도','하계학기','학부','수학전공','MAT2230','01','미분방정식',NULL,3,'월,화,수,목,금 13:00~15:45','김현정','0000000034','','','','','','','','','전학년','2학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(246,'2021 학년도','하계학기','학부','수학전공','MAT2420','01','응용수학II',NULL,3,'월,화,수,목,금 09:00~11:45','유지현','0000000032','','','','','','','','','전학년','2학년','컴퓨터공학전공(가능)','컴퓨터공학전공만 가능','컴퓨터공학전공만 가능',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(247,'2021 학년도','하계학기','학부','수학전공','MAT3020','01','통계학입문',NULL,3,'월,화,수,목,금 09:00~11:45','임경필','0000000028','','','','','','','','','전학년','2학년','컴퓨터공학전공(1전공 불가능)','응용수학I(MAT2410)과 동등한 과목임','컴퓨터공학 1전공학생 수강불가(응용수학I과 동등과목)',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(248,'2021 학년도','하계학기','학부','경제학전공','ECO2001','01','경제학원론I',NULL,3,'월,화,수,목,금 13:00~15:45','김형욱','0000000052','','','','','','','','','전학년','1학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(249,'2021 학년도','하계학기','학부','경제학전공','ECO2002','01','경제학원론II',NULL,3,'월,화,수,목,금 09:00~11:45','김숙영','0000000051','','','','','','','','','전학년','1학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(250,'2021 학년도','하계학기','학부','경제학전공','ECO2003','01','경제수리기초',NULL,3,'월,화,수,목,금 09:00~11:45','박경옥','0000000055','','','','','','','','','전학년','1학년','','','미적분학I, II 수강자 및 07학번 이전 학생 수강불가',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(251,'2021 학년도','하계학기','학부','경제학전공','ECO2007','01','거시경제학I',NULL,3,'월,화,수,목,금 13:00~15:45','김숙영','0000000026','','','','','','','','','전학년','2학년','','선수과목:ECO2001,ECO2002,ECO2003(또는 STS2005 또는 STS2006)','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(252,'2021 학년도','하계학기','학부','경제학전공','ECO3020','01','경제학현장실습',NULL,3,'','김영익','0000000007','','','','','','','O','','','3-4학년','','','현장실습과목, 수강승인과목, 경제학부 홈페이지 참고',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'',NULL,NULL),(253,'2021 학년도','하계학기','학부','생명과학전공','BIO4100','01','생명과학인턴쉽',NULL,3,'','Lee, Hosuk Sean','0000000007','','','','','','','O','','전학년','3-4학년','','과목평가:S/U','3~4학년 대상 현장실습과목, 자연과학부행정팀(R209호)에서 수강신청',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'',NULL,NULL),(254,'2021 학년도','하계학기','학부','경영학전공','MGT2002','01','경영통계학',NULL,3,'월,화,수,목,금 13:00~15:45','정예숙','0000000028','','','','','','','','','전학년','1학년','수학전공,컴퓨터공학전공(1전공 불가능)','수학,컴공전공자,통계학입문수강자 불가(통계학입문,경제통계학으로대체가능)','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(255,'2021 학년도','하계학기','학부','경영학전공','MGT2003','01','회계학원론',NULL,3,'월,화,수,목,금 13:00~15:45','김아람','0000000053','','','','','','','','','전학년','1-2학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(256,'2021 학년도','하계학기','학부','경영학전공','MGT3001','01','조직행동이론',NULL,3,'월,화,수,목,금 09:00~11:45','이지운','0000000049','','','','','','','','','전학년','2-4학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(257,'2021 학년도','하계학기','학부','경영학전공','MGT3007','01','국제경영론',NULL,3,'월,화,수,목,금 09:00~11:45','유치연','0000000057','','','','','','','','','전학년','2-4학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(258,'2021 학년도','하계학기','학부','경영학전공','MGT4102','01','경영전략',NULL,3,'월,화,수,목,금 09:00~11:45','이승혜','0000000049','','','','','','','','','전학년','2-4학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(259,'2021 학년도','하계학기','학부','경영학전공','MGT4705','01','경영인턴쉽',NULL,3,'','정유신','0000000004','','','','','','','O','','전학년','3-4학년','','수강승인과목, 성적평가:S/U','전공현장실습과목',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'',NULL,NULL),(260,'2021 학년도','하계학기','학부','화학전공','CHM1001','01','일반화학I',NULL,3,'월,화,수,목,금 09:00~11:45','이용우','0000000061','','','','','','','','','전학년','1학년','','','온라인강의',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(261,'2021 학년도','하계학기','학부','화학전공','CHM4056','01','화학산업과인턴쉽1',NULL,3,'','이현수','0000000005','','','','','','','O','','전학년','3-4학년','','과목평가:S/U','자연과학부행정팀에서 수강신청',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'',NULL,NULL),(262,'2021 학년도','하계학기','학부','전자공학전공','EEE2187','01','전자공학현장실습',NULL,3,'','정옥현','0000000001','','','','','','','O','','','2학년','','','현장실습과목',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'',NULL,NULL),(263,'2021 학년도','하계학기','학부','화공생명공학전공','CBE3010','01','양자화학',NULL,3,'월,화,수,목,금 13:00~15:45','김충익','0000000021','','','','','','','','','전학년','3학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(264,'2021 학년도','하계학기','학부','화공생명공학전공','CBE4021','01','나노기술의이해',NULL,3,'월,화,수,목,금 09:00~11:45','김충익','0000000023','O','','','','','','','','2학년','1-4학년','화공생명공학전공(가능)','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(265,'2021 학년도','하계학기','학부','화공생명공학전공','CBE4100','01','인턴쉽I',NULL,3,'','문준혁','0000000001','','','','','','','O','','전학년','3-4학년','','과목평가:S/U','수강승인: 학과에 문의',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'',NULL,NULL),(266,'2021 학년도','하계학기','학부','사회학전공','SOC2001','01','사회학개론',NULL,3,'월,화,수,목,금 13:00~15:45','민병교','0000000024','','','','','','','','','전학년','1-4학년','','','비대면수업',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(267,'2021 학년도','하계학기','학부','컴퓨터공학전공','CSE4190','01','인턴쉽',NULL,3,'','구명완','0000000014','','','','','','','O','','','3-4학년','','','컴퓨터공학전공 3학년 이상만 가능. 수강승인(문의: 713-8485)',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'',NULL,NULL),(268,'2021 학년도','하계학기','학부','기계공학전공','MEE4070','01','기계공학인턴쉽I',NULL,3,'','신충수','0000000005','','','','','','','O','','전학년','3-4학년','','과목평가:S/U','과목평가:S/U, 현장실습과목/수강승인과목(문의:705-8631)/기계공학전공자만 가능',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'',NULL,NULL),(269,'2021 학년도','하계학기','학부','심리학전공','PSY2001','01','일반심리학',NULL,3,'월,화,수,목,금 13:00~15:45','조명현','0000000038','','','','','','','','','전학년','1-4학년','','','비대면수업',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(270,'2021 학년도','하계학기','학부','심리학전공','PSY2003','01','발달심리학',NULL,3,'월,화,수,목,금 13:00~15:45','김근영','0000000060','','','','','','','','','전학년','1-4학년','','','비대면수업',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(271,'2021 학년도','하계학기','학부','전인교육원','CHS2002','01','현대한국의형성',NULL,3,'월,화,수,목,금 09:00~11:45','김혜정','0000000049','','','','','','','','','전학년','1-2학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(272,'2021 학년도','하계학기','학부','전인교육원','CHS2003','01','현대동아시아의형성',NULL,3,'월,화,수,목,금 13:00~15:45','정녕','0000000045','','','','','','','','','전학년','1-2학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(273,'2021 학년도','하계학기','학부','전인교육원','CHS2004','01','현대서양의형성',NULL,3,'월,화,수,목,금 13:00~15:45','이종훈','0000000023','','','','','','','','','전학년','1-2학년','','근대시민사회의형성(SHU4017)의 대체과목/영미문화의이해(LCU4010)의 대체과목','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(274,'2021 학년도','하계학기','학부','전인교육원','COR1003','01','영어글로벌의사소통I',NULL,3,'월,화,수,목,금 09:00~11:45','홍진영','0000000022','O','','','','','','','','전학년','1학년','','구 영어I, 신입생 대다수의 학생이 대상','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(275,'2021 학년도','하계학기','학부','전인교육원','COR1003','02','영어글로벌의사소통I',NULL,3,'월,화,수,목,금 09:00~11:45','조혜연','0000000024','O','','','','','','','','전학년','1학년','','구 영어I, 신입생 대다수의 학생이 대상','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(276,'2021 학년도','하계학기','학부','전인교육원','COR1003','03','영어글로벌의사소통I',NULL,3,'월,화,수,목,금 13:00~15:45','이주영','0000000021','O','','','','','','','','전학년','1학년','','구 영어I, 신입생 대다수의 학생이 대상','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(277,'2021 학년도','하계학기','학부','전인교육원','COR1009','01','컴퓨팅사고력',NULL,3,'월,화,수,목,금 09:00~11:45','나미향','0000000057','','','','','','','','','전학년','1학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(278,'2021 학년도','하계학기','학부','전인교육원','COR1012','01','인문사회글쓰기',NULL,3,'월,화,수,목,금 13:00~15:45','조원규','0000000027','','','','','','','','','전학년','1학년','','읽기와쓰기(COR1001)의 대체과목','부제:문학예술과 창의적 글쓰기',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(279,'2021 학년도','하계학기','학부','전인교육원','COR1012','02','인문사회글쓰기',NULL,3,'월,화,수,목,금 09:00~11:45','엄미옥','0000000027','','','','','','','','','전학년','1학년','','읽기와쓰기(COR1001)의 대체과목','부제:세계와 나',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(280,'2021 학년도','하계학기','학부','전인교육원','COR1012','03','인문사회글쓰기',NULL,3,'월,화,수,목,금 13:00~15:45','심진경','0000000019','','','','','','','','','전학년','1학년','','읽기와쓰기(COR1001)의 대체과목','부제:젠더와 문화',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(281,'2021 학년도','하계학기','학부','전인교육원','COR1013','01','자연계글쓰기',NULL,3,'월,화,수,목,금 13:00~15:45','장서란','0000000026','','','','','','','','','전학년','1학년','','읽기와쓰기(COR1001)의 대체과목','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(282,'2021 학년도','하계학기','학부','전인교육원','ETS2001','01','현대세계와윤리문제',NULL,3,'월,화,수,목,금 09:00~11:45','류희성','0000000010','','','','','','','','','전학년','1-4학년','','구 윤리와가치','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(283,'2021 학년도','하계학기','학부','전인교육원','ETS2002','01','논리와비판적사고',NULL,3,'월,화,수,목,금 13:00~15:45','서상복','0000000015','','','','','','','','','전학년','1-4학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(284,'2021 학년도','하계학기','학부','전인교육원','ETS2004','01','종교와세계문화',NULL,3,'월,화,수,목,금 09:00~11:45','현재우','0000000028','','','','','','','','','전학년','1-4학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(285,'2021 학년도','하계학기','학부','전인교육원','HFS2001','01','철학적인간학',NULL,3,'월,화,수,목,금 13:00~15:45','김승욱','0000000063','','','','','','','','','전학년','2학년','','인간과세계에대한관상(스탈링스)(SHU4055)의 대체과목','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(286,'2021 학년도','하계학기','학부','전인교육원','HFS2002','01','신학적인간학',NULL,3,'월,화,수,목,금 13:00~15:45','강선남','0000000050','','','','','','','','','전학년','2학년','','신의문제(HFS2005)의 대체과목/그리스도교사상(HFS2004)의 대체과목','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(287,'2021 학년도','하계학기','학부','전인교육원','HSS3011','01','영어토론세미나',NULL,3,'월,화,수,목,금 09:00~11:45','Willers, Arthur Gregory','0000000025','O','','','','','','','','전학년','2-4학년','','상대평가 예외','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(288,'2021 학년도','하계학기','학부','전인교육원','SHS2003','01','커뮤니케이션과사회',NULL,3,'월,화,수,목,금 13:00~15:45','임인재','0000000017','','','','','','','','','전학년','1-4학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(289,'2021 학년도','하계학기','학부','전인교육원','STS2004','01','대학수학',NULL,3,'월,화,수,목,금 09:00~11:45','김순영','0000000037','','','','','','','','','전학년','1학년','자연과학부,공학부(불가능)','자연과학부,공학부 수강불가/수학과시각예술(ANT2020)의 대체과목','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(290,'2021 학년도','하계학기','학부','전인교육원','STS2005','01','미적분학I',NULL,3,'월,화,수,목,금 09:00~11:45','안일주','0000000059','','','','','','','','','전학년','1학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(291,'2021 학년도','하계학기','학부','전인교육원','STS2006','01','미적분학II',NULL,3,'월,화,수,목,금 13:00~15:45','강유태','0000000060','','','','','','','','','전학년','1학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(292,'2021 학년도','하계학기','학부','전인교육원','STS2008','01','고급응용C프로그래밍',NULL,3,'월,화,수,목,금 13:00~15:45','강은숙','0000000053','','','','','','','','','전학년','2학년','컴퓨터공학전공(1전공 불가능)','(구)C언어[C프로그래밍수강자,컴공1전공수강불가]/STS2007 대체과목','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(293,'2021 학년도','하계학기','학부','전인교육원','STS2010','01','과학사',NULL,3,'월,화,수,목,금 09:00~11:45','이정희','0000000058','','','','','','','','','전학년','1-2학년','','','비대면수업',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(294,'2021 학년도','하계학기','학부','전인교육원','TLS1004','01','영어글로벌의사소통II',NULL,3,'월,화,수,목,금 09:00~11:45','이현숙','0000000019','O','','','','','','','','전학년','1학년','','영어II(고급)(COR1006)의 대체과목/영어II(COR1004)의 대체과목','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(295,'2021 학년도','하계학기','학부','전인교육원','TLS1004','02','영어글로벌의사소통II',NULL,3,'월,화,수,목,금 13:00~15:45','Barnard,Stephen John','0000000017','O','','','','','','','','전학년','1학년','','영어II(고급)(COR1006)의 대체과목/영어II(COR1004)의 대체과목','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(296,'2021 학년도','하계학기','학부','공공인재 연계전공','PUB3003','01','법치행정의이해',NULL,3,'월,화,수,목,금 09:00~11:45','김광수','0000000024','','','','','','','','','전학년','1-4학년','','구 SHU4047, 법치주의의이해','비대면수업',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(297,'2021 학년도','하계학기','학부','융합소프트웨어연계전공','CSW3020','01','운영체제입문',NULL,3,'월,화,수,목,금 09:00~11:45','장나은','0000000019','','','','','','','','','전학년','2-4학년','전자공학전공,컴퓨터공학전공(불가능)','전자공학, 컴퓨터공학전공자 수강 불가','비대면수업',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(298,'2021 학년도','하계학기','학부','신문방송학전공','JAS3001','01','저널리즘개론',NULL,3,'월,화,수,목,금 09:00~11:45','김지연','0000000022','','','','','','','','','전학년','2학년','','구) COM3101 저널리즘개론','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(299,'2021 학년도','하계학기','학부','미디어&엔터테인먼트전공','MAE3004','01','영화입문',NULL,3,'월,화,수,목,금 13:00~15:45','정흠문','0000000027','','','','','','','','','전학년','2학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(300,'2021 학년도','하계학기','학부','미디어&엔터테인먼트전공','MAE3014','01','커뮤니케이션학입문',NULL,3,'월,화,수,목,금 13:00~15:45','조재희','0000000023','','','','','','','','','전학년','1-2학년','','구) COM2001 / 커뮤 전공필수','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL),(301,'2021 학년도','하계학기','학부','아트&테크놀로지전공','AAT4012','01','Internship',NULL,3,'','김주섭','0000000002','','','','','','','O','','','1-4학년','','과목평가:S/U','현장실습 (문의:지식융합미디어학부행정팀)',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'',NULL,NULL),(302,'2021 학년도','하계학기','학부','인공지능연계전공','AIC4011','01','인공지능종합설계Ⅱ(캡스톤디자인)',NULL,3,'월,화,수,목,금 13:00~15:45','박운상','0000000001','','','','','','','','','전학년','4학년','','','',NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'6.0',NULL,NULL);
/*!40000 ALTER TABLE `s21_s` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-11-09 11:32:23
